app/views/users/carddata.html.erb

        <%= form.label :"金額(kingaku)", class: 'u_text-white' %>
        <%= form.collection_select( :amount, Kingaku.all, :kingaku, :kingaku,  {include_blank: true, selected: params[:amount]}, {class: "form-control input-sm", disabled: true,}) %>
---
SELECT "kingakus".* FROM "kingakus"