app/views/users/confirm.html.erb

SELECT "level_kibous".* FROM "level_kibous"
---
            <%= f.label :"レベル希望(level_kibou)", class: 'u_text-white' %>
            <%= f.collection_select( :level_kibous_id, LevelKibou.all, :id, :name, {prompt:  "選択してください"}, {class: "form-control input-sm"}) %>

SELECT "level_kakuteis".* FROM "level_kakuteis"
---
            <%= f.label :"レベル確定(level_kakutei)", class: 'u_text-white' %>
            <%= f.collection_select( :level_kakuteis_id, LevelKakutei.all, :id, :name, {prompt:  "選択してください"}, {class: "form-control input-sm"}) %>

SELECT "lesson_styles".* FROM "lesson_styles"
---
            <%= f.label :"レッスンスタイル(lesson_styles_id)", class: 'u_text-white' %>
            <%= f.collection_select( :lesson_styles_id, LessonStyle.all, :id, :name, {prompt:  "選択してください"}, {class: "form-control input-sm"}) %>

SELECT "fee_howtos".* FROM "fee_howtos"
---
            <%= f.label :"支払い方法(fee_howto)", class: 'u_text-white' %>
            <%= f.collection_select( :fee_howtos_id, FeeHowto.all, :id, :name, {prompt:  "選択してください"}, {class: "form-control input-sm"}) %>

SELECT "pinano_owneds".* FROM "pinano_owneds"
---
            <%= f.label :"ピアノ有無(pinano_owned)", class: 'u_text-white' %>
            <%= f.collection_select( :pinano_owned_id, PinanoOwned.all, :id, :name, {prompt:  "選択してください"}, {class: "form-control input-sm"}) %>

SELECT "pinano_histories".* FROM "pinano_histories"
---
            <%= f.label :"ピアノ歴(pinano_history)", class: 'u_text-white' %>
            <%= f.collection_select( :pinano_histories_id, PinanoHistory.all, :id, :name, {prompt:  "選択してください"}, {class: "form-control input-sm"}) %>