app/views/users/paymenttest.html.erb

        <%= form.label :"金額(kingaku)", class: 'u_text-white' %>
        <%= form.collection_select( :amount, Kingaku.all, :kingaku, :kingaku, {prompt:  "選択してください"}, {class: "form-control input-sm"}) %>
---
SELECT "kingakus".* FROM "kingakus"