app/controllers/meetings_controller.rb

SELECT  "fees".* FROM "fees" WHERE "fees"."level" = $1 AND "fees"."style" = $2 LIMIT $3  [["level", 2], ["style", 2], ["LIMIT", 1]]
SELECT  "nyukins".* FROM "nyukins" WHERE "nyukins"."users_id" = $1 LIMIT $2  [["users_id", 12], ["LIMIT", 1]]
UPDATE "nyukins" SET "zandaka" = $1, "yoyakukin" = $2, "updated_at" = $3 WHERE "nyukins"."id" = $4  [["zandaka", 20500], ["yoyakukin", 1500], ["updated_at", "2019-10-14 06:16:11.709760"], ["id", 1]]
---
  def create
    ###@meeting = Meeting.new(meeting_params)
    ##date=params[:meeting][:start_date]
    #binding.pry
    @meeting = Meeting.new(meeting_params)
    @meeting.users_id=current_user.id

    sdate = DateTime.parse(params[:meeting][:start_date])
    sdatestr = sprintf("%d-%d-%d %d:%d:%d", sdate.year, sdate.month, sdate.day, @meeting.start_time.hour, @meeting.start_time.min, @meeting.start_time.sec)
    ##binding.pry
    @meeting.start_time = sdatestr
    @meeting.end_time = @meeting.start_time + 1800
    #binding.pry

    # 料金を入金テーブルから予約列に移動
    fee=Fee.find_by(level: current_user.level_kakuteis_id, style: current_user.lesson_styles_id)
    ryoukin=fee.kingaku / fee.style
    nyukin=Nyukin.find_by(users_id: current_user.id)
    if !nyukin.nil?  && !nyukin.zandaka.nil? && nyukin.zandaka >= ryoukin
      if nyukin.yoyakukin.nil?
        nyukin.yoyakukin=ryoukin
      else
        nyukin.yoyakukin+=ryoukin
      end

      nyukin.zandaka-=ryoukin
      nyukin.save

INSERT INTO "meetings" ("name", "description", "start_time", "end_time", "users_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def update

    @meeting.name=meeting_params[:name]
    @meeting.description=meeting_params[:description]
    sdate = DateTime.parse(params[:meeting][:start_date])
    #sdatestr = sprintf("%d-%d-%d %d:%d:%d", sdate.year, sdate.month, sdate.day, @meeting.start_time.hour, @meeting.start_time.min, @meeting.start_time.sec)
    #sdatestr = sprintf("%d-%d-%d %d:%d:00", sdate.year, sdate.month, sdate.day, params[:meeting][:start_time(4i)], params[:meeting][:start_time(5i)])
    sdatestr = sprintf("%d-%d-%d %d:%d:00", sdate.year, sdate.month, sdate.day, params[:meeting]["start_time(4i)"], params[:meeting]["start_time(5i)"])
    @meeting.start_time = sdatestr
    @meeting.end_time = @meeting.start_time + 1800
    #binding.pry
    respond_to do |format|
      #if @meeting.update(meeting_params)
      if @meeting.save