app/controllers/meetings_controller.rb

SELECT "meetings".* FROM "meetings" WHERE "meetings"."users_id" = $1  [["users_id", 12]]
---
  def index
    ##@meetings = Meeting.all
    @meetings = Meeting.where(users_id: current_user.id)

INSERT INTO "meetings" ("name", "description", "start_time", "end_time", "users_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    ###@meeting = Meeting.new(meeting_params)
    ##date=params[:meeting][:start_date]
    #binding.pry
    @meeting = Meeting.new(meeting_params)
    @meeting.users_id=current_user.id

    sdate = DateTime.parse(params[:meeting][:start_date])
    sdatestr = sprintf("%d-%d-%d %d:%d:%d", sdate.year, sdate.month, sdate.day, @meeting.start_time.hour, @meeting.start_time.min, @meeting.start_time.sec)
    ##binding.pry
    @meeting.start_time = sdatestr
    @meeting.end_time = @meeting.start_time + 1800
    #binding.pry

    respond_to do |format|
      if @meeting.save

INSERT INTO "meetings" ("name", "description", "start_time", "end_time", "users_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "meetings" SET "start_time" = $1, "end_time" = $2, "updated_at" = $3 WHERE "meetings"."id" = $4  [["start_time", "2019-10-22 04:00:00"], ["end_time", "2019-10-22 04:30:00"], ["updated_at", "2019-10-12 02:10:30.988545"], ["id", 13]]
---
  def update

    @meeting.name=meeting_params[:name]
    @meeting.description=meeting_params[:description]
    sdate = DateTime.parse(params[:meeting][:start_date])
    #sdatestr = sprintf("%d-%d-%d %d:%d:%d", sdate.year, sdate.month, sdate.day, @meeting.start_time.hour, @meeting.start_time.min, @meeting.start_time.sec)
    #sdatestr = sprintf("%d-%d-%d %d:%d:00", sdate.year, sdate.month, sdate.day, params[:meeting][:start_time(4i)], params[:meeting][:start_time(5i)])
    sdatestr = sprintf("%d-%d-%d %d:%d:00", sdate.year, sdate.month, sdate.day, params[:meeting]["start_time(4i)"], params[:meeting]["start_time(5i)"])
    @meeting.start_time = sdatestr
    @meeting.end_time = @meeting.start_time + 1800
    #binding.pry
    respond_to do |format|
      #if @meeting.update(meeting_params)
      if @meeting.save