app/controllers/users_controller.rb

INSERT INTO "users" ("username", "kanji_name", "firstname", "lastname", "email", "email2", "age", "address", "zip_code", "mobile_phone", "emagency_phone", "emagency_zokugara", "emagency_name", "emagency_kana", "name_kana", "lesson_kaisu", "lesson_nobekaisu", "join_date", "lesson_styles_id", "fee_howtos_id", "level_kibous_id", "level_kakuteis_id", "pinano_histories_id", "pinano_owned_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "meetings".* FROM "meetings" WHERE "meetings"."users_id" = $1  [["users_id", 11]]
---
  def usergamen
    @meetings = Meeting.where(users_id: current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def usershow
    ##binding.pry
    @user = User.find(current_user.id)

SELECT  "nyukins".* FROM "nyukins" WHERE "nyukins"."users_id" = $1 LIMIT $2  [["users_id", 12], ["LIMIT", 1]]
---
  def pay
    # cookieから金額を読み込んで金額ammount:に入れる
    #Payjp.api_key = 'Payjp の画面から取得した秘密鍵'
    ##binding.pry

    ## 金額チェック
    ##binding.pry
    if params[:amount] == "" || params[:amount].nil?
      flash.now[:danger] = "入力に不備があります。登録に失敗しました"
      puts "error"
      redirect_to :paymenttest and return
    else
      #binding.pry
      Payjp.api_key =ENV.fetch("PAYJP_SK")
      Payjp::Charge.create(
      #amount: params[:amount], # 決済する値段
      ##amount: cookies['kingaku'].to_i,
      amount: params[:amount].to_i,
      card: params['payjp-token'],
      currency: 'jpy'
      )
      ## 入金が成功したら表示
      ###flash.now[:success] = "入金に成功しました"
      ## 成功していたら入金データに記録
      ## 入金テーブル更新
      nyukin=Nyukin.find_by(users_id: current_user.id)

INSERT INTO "nyukins" ("zandaka", "users_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["zandaka", 2000], ["users_id", 12], ["created_at", "2019-10-14 05:20:43.571624"], ["updated_at", "2019-10-14 05:20:43.571624"]]
UPDATE "nyukins" SET "zandaka" = $1, "updated_at" = $2 WHERE "nyukins"."id" = $3  [["zandaka", 4000], ["updated_at", "2019-10-14 05:32:29.306713"], ["id", 1]]
---
      else
        nyukin.zandaka+=params[:amount].to_i
      end
      nyukin.save